/*
*
*　　　　　　　　　　／　　　 　 　 /　　 　 　 　 ＼　 　 ＼
*　　　　　 　 　 ／　 　 　 ./　　/　　　　　　　　　ヽ 　 　 ＼
*　　　　　 　 .　 　 　 . 　 /　　/　　　　 　 　 　 　 　 .　 .　　ヽ
*　　　　　　/　　　　/　 /|　　iト、　　　　　　　　　　　∨ ./　 ハ
*　　 　 　 .　　　　 /　 / l!　　.!　＼　　　_　　　　 　 　 ∨ //
*　　　　　i 　 　 　 　 / _ |　 从 　　＼´　 ￣ ｀　 . 　 　 ∨　　　i
*　　　　　ｌ　　　　　 /'´　从　　＼　⌒＼ 　 　 　 i　　 　 !　　　 |
*　　　　　| !　　　　 {　　 ´人　 　 ヽ 　 　＼ 　 .　|　　　i l　　 i　!
*　　　　　N　ｌ |　　 ﾊ　 　 　 ＼j＼j ＝≠彡ヽ　! ﾄ.　　 i |　　 ! l|
*　　　　　人 | i !　/ ﾊ =≠彡　　　　　　　　　Ni| l!ﾊ 　 从　　j ﾘ
*　　　　　　　Nル'　j/}　　　 '　　　 　 　 　 　 | l|ﾘ　j　/ 　∨/./
*　　　　 　 　 　 　 //|　　　　_　 _.　　　　　__ﾉノ　 ﾑｲ　Y´￣｀ﾒ.
*.　　　　　 　 　 　 ﾚ从　　　　　　　　　　 ´　 __　 ／　　{　　　　}
*　 　 　 　 　 　 　 　 /＼　　　　　　　　　　. ィf ´　　　人　　 ! ﾒ
*　　　　　　　　　　　〈 　　ト .　　　　　.　　　　 |__r‐ｙ'´{　 ＼ノｲ　}
*　　　　 　 　 　 　 　 ｀弋フ　≧＝て!　　　 　 |　∨ .从 __ ノ　j ノ
*　　　　　　　　　　　　　　｀ 弋 __ ノ/}　　 　 ／　 j! __ __ ノ
*　　　　　　　　　　　　　　　　　　/7/!　　 ／　　 /ﾆ＼
*　　　　　　　　　　　　　　 x＜7/ j /　 ／　　　 /二二.＼
*　　　　　　　　　　　　x＜二ﾆ7/^～ く　 　 　 /ﾆ二二二.＼
*
*/